[
  {
    "id": 0,
    "pname": "The Blind Community needs your help",
    "oname": "by Singapore Association of the Visually Handicapped",
    "picture": "images/donation0.jpg",
    "description": "The Singapore Association of the Visually Handicapped has many programmes & services that benefit the Blind & Low Vision Service Users in Singapore. Their love and care to the visually impaired community including the elderly and the low income families who are blind is commendable.Let's be part of this noble cause and donate generously so that, even with Covid19 where donations have slowed, we can help raise funds through this Virtual crowdfunding campaign for SAVH to continue their support to the service users. Given that the intended SAVH Charity Donation Draw was not proceeding due to Covid19, we hope this crowdfunding will bring in some funds for SAVH to continue running their unfunded programmes and services for the blind community. Come, in this new normal, let's be part of the equation to include our visually impaired brothers and sisters who needs us to share our love and care with them. Thanks in advance."
  },
  {
    "id": 1,
    "pname": "Give me hope",
    "oname": "by Children-At-Risk Empowerment Association (CARE Singapore)",
    "picture": "images/donation1.jpg",
    "description": "PSLE and other Exams are over and the chance is here to start anew.Help us provide emotional support to students before and after exams so that they can cope with the stresses.Hello 2021 - Every young life is precious and needs care."
  },
  {
    "id": 2,
    "pname": "Support Seniors with New Wheels",
    "oname": "by AMKFSC Community Services",
    "picture": "images/donation2.jpg",
    "description": "As we settle into Phase 3 of Singapore's Covid-19 reopening, most of us are probably looking forward to the upcoming festivities with loved ones amidst the pandemic. However, for some seniors, celebrating Chinese New Year will be a challenge. 'I've used this wheelchair for many years, but I can't afford to replace it. All it needs is a new set of wheels and it's good to go,' says Mr Lim, a beneficiary of AMKFSC's COMNET Senior Service. For wheelchair-bound elderly like Mr Lim, leaving home and getting around is a problem exacerbated by maintenance issues with their wheelchairs. This may lead to isolation and loneliness, even more so during the festive season.Start the New Year on an auspicious note by giving back! Your donation can help to maintain, replace and fix problematic parts of their wheelchairs and provide seniors with mobility to immerse in the festive atmosphere with the community."
  }
]
